Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# ErrorResource_ErrOperandExpected_HowToFix_1
source: Supply an operand value that will complete the expression. Ensure that the operand's type (text, number, date, or true/false) fits the expression. Match numbers with numbers, text with text, and so on. For example, '1 + "Hi"' isn't valid, but '1 + 2' is valid.
bg_bg: Предоставете стойност за операнда, която ще завърши израза. Уверете се, че типът операнд (текст, цифра, дата или true/false) приляга на израза. Съчетавайте числа с числа, текст с текст и т.н. Например „1 + Hi“ не е валидно, но „1 + 2“ е валидно.
ca_es: Proporcioneu un valor d'operand que completi l'expressió. Assegureu-vos que el tipus de l'operand (text, número, data o vertader/fals) encaixi amb l'expressió. Feu coincidir els números amb números, el text amb text i així successivament. Per exemple, "1 +'Hola'" no és vàlid, però sí que ho és "1 + 2".
cs_cz: Zadejte hodnotu operandu, která dokončí výraz. Ujistěte se, že typ operandu (text, číslo, datum nebo true/false) je pro daný výraz vhodný. K číslům patří čísla, k textu text apod. Třeba 1 + "Ahoj" není platné, ale 1 + 2 je.
da_dk: Angiv en operand-værdi, der vil fuldføre udtrykket. Sørg for, at de operandtypen (tekst, tal, dato eller sand/falsk) passer til udtrykket. Svarer til tal med tal, tekst med tekst, osv. For eksempl er '1 + "Hej"' ugyldig, mens '1 + 2' er gyldig.
de_de: Geben Sie einen Operandenwert an, der den Ausdruck vervollständigt. Stellen Sie sicher, dass der Typ des Operanden (Text, Zahl, Datum oder TRUE/FALSE) zum Ausdruck passt. Wenn der Ausdruck textbasiert ist, muss der Operandentyp ebenfalls "Text" lauten. Enthält der Ausdruck Zahlen, muss auch der Operand ein Zahlenwert sein. Beispiele: "1 + "Hallo"" ist nicht gültig, aber "1 + 2" ist gültig.
el_gr: Παράσχετε μια τιμή τελεστέου που θα ολοκληρώσει την παράσταση. Βεβαιωθείτε ότι ο τύπος τελεστέου (κείμενο, αριθμός, ημερομηνία ή true/false) ταιριάζει με την παράσταση. Αντιστοιχίστε αριθμούς με αριθμούς, κείμενο με κείμενο και ούτω καθεξής. Για παράδειγμα, το "1 + "Γεια"" δεν είναι έγκυρο, αλλά το "1 + 2" είναι έγκυρο.
es_es: Proporcione un valor de operando que complete la expresión. Asegúrese de que el tipo del operando (texto, número, fecha o true/false) se ajuste a la expresión. Asigne los números con números, el texto con texto, etc. Por ejemplo, "1 + "Hi"" no es válido, pero "1 + 2", sí.
et_ee: Edastage operandi väärtus, mis lõpetab väljendi. Veenduge, et operandi tüüp (tekst, arv, kuupäev või tõene/väär) sobiks väljendiga. Vastendage arvud arvudega, tekst tekstiga jne. Näiteks '1 + "Hi"' pole sobiv, kuid '1 + 2' on sobiv.
eu_es: Idatzi espresioa osatuko duen eragingaiaren balioa. Ziurtatu eragingaia mota (testua, zenbakia, data edo true/false) espresioarekin bat datorrela. Zenbakiak zenbakiekin bat datoz, testua testuarekin, eta abar. Adibidez, "1 + "Hi"" espresioak ez du balio, baina "1 + 2" erabil daiteke.
fi_fi: Anna operandin arvo, joka viimeistelee lausekkeen. Varmista, että operandin tyyppi (teksti, luku, päivämäärä tai true/false) sopii lausekkeelle. Täsmää luvut luvuilla, teksti tekstillä ja niin edelleen. Esimerkiksi 1 + "Hi" ei ole kelvollinen mutta 1 + 2 on.
fr_fr: Fournir une valeur d’opérande qui complètera l’expression. Assurez-vous que le type d’opérande (texte, nombre, date ou vrai/faux) corresponde à l’expression. Faites correspondre des nombres à des nombres, du texte à du texte, etc. Par exemple, « 1+"Bonjour" » n’est pas valide, mais « 1 + 2 » est valide.
gl_es: Forneza un valor de operando que concluirá a expresión. Asegúrese de que o tipo de operando (texto, número, data, ou verdadeiro/falso) se axuste automaticamente á expresión. Faga coincidir os números con números, o texto con texto, etc. Por exemplo, "1 + "Hi"" non é válido, pero "1 + 2" é válido.
hi_in: एक ऐसा ऑपरेंड मान प्रदान करें जो व्यंजक को पूर्ण कर दे. सुनिश्चित करें कि ऑपरेंड का प्रकार (पाठ, संख्या, दिनांक या सही/गलत) व्यंजक में फ़िट हो जाए. संख्याओं का संख्याओं से, पाठ का पाठ से और इसी तरह बहुत कुछ मेल कराएँ. उदाहरण के लिए, '1 + "Hi" ' मान्य नहीं है, लेकिन '1 + 2' मान्य है.
hr_hr: Unesite vrijednost operanda koji će dovršiti izraz. Provjerite odgovara li vrsta operanda (tekst, broj, datum ili true/false) izrazu. Uparite brojeve s brojevima, tekst s tekstom itd. "1 + "Pozdrav", na primjer, nije valjano, ali "1 + 2" jest.
hu_hu: Olyan operandusértéket adjon meg, amely befejezi a kifejezést. Győződjön meg arról, hogy az operandus típusa (szöveg, szám, dátum vagy igaz/hamis) illeszkedik a kifejezésbe. A számokat számokkal, a szöveget szöveggel párosítsa, és így tovább. Például az „1 + "Üdvözöljük"” érvénytelen, az „1 + 2” viszont érvényes.
it_it: Specificare il valore dell'operando che completerà l'espressione. Assicurarsi che il tipo di operando (testo, numero, data o vero/falso) sia adatto all'espressione. Abbinare numeri a numeri, testo a testo e così via. Ad esempio, '1 + "Cari"' non è valido, ma '1 + 2' è valido.
ja_jp: 式を完成させるオペランド値を指定してください。オペランドの型 (テキスト、数値、日付、true/false) が、式に対して適切であることを確認してください。数値には数値、テキストにはテキストを対応付けます。たとえば、'1 + "Hi"' は無効ですが、'1 + 2' は有効です。
kk_kz: Өрнекті аяқтайтын операнд мәнін беріңіз. Операнд түрінің (мәтін, сан, күн немесе шын/жалған) өрнекке сәйкестігіне көз жеткізіңіз. Сандарды сандармен, мәтінді мәтінмен және т.б. сәйкестендіріңіз. Мысалы, "1 + "Hi"" жарамсыз, ал "1 + 2" жарамды.
ko_kr: 식을 완료하는 피연산자 값을 제공합니다. 피연산자 유형(텍스트, 숫자, 날짜 또는 true/false)이 식과 일치하는지 확인합니다. 숫자는 숫자끼리, 텍스트는 텍스트끼리, 같은 유형끼리 일치시킵니다. 예를 들어 '1 + "Hi"'는 유효하지 않지만 '1 + 2'는 유효합니다.
lt_lt: Nurodykite operando reikšmę, kuri užbaigs išraišką. Įsitikinkite, kad operando tipas (tekstas, skaičius, data arba TRUE/FALSE), tinka išraiškai. Skaičius derinkite su skaičiais, tekstą – su tekstu ir t. t. Pavyzdžiui, 1 + Sveiki netinka, o 1 + 2 tinka.
lv_lv: Norādiet operanda vērtību, kas tiks izmantota izteiksmes pabeigšanai. Nodrošiniet, lai operanda veids (teksts, skaitlis, datums vai true/false) atbilstu izteiksmes veidam. Skaitļi atbilst skaitļiem, teksts — tekstam utt. Piemēram, izteiksme “1 + "Hi"” nav derīga, savukārt “1 + 2” — ir derīga.
ms_my: Bekalkan nilai operan tidak yang akan menyelesaikan ungkapan. Pastikan jenis operan yang (teks, nombor, tarikh atau true/false) sesuai dengan ungkapan. Padan dengan nombor, teks dengan teks, nombor dan seterusnya. Contohnya, '1 + "Hi" ' adalah tidak sah, tetapi '1 + 2' adalah sah.
nb_no: Angi en operand-verdi som fullfører uttrykket. Kontroller at typen operand (tekst, tall, dato eller riktig/galt) passer uttrykket. Samkjør tall med tall, tekst med tekst og så videre. For eksempel er '1 + "Hei" ugyldig, mens '1 + 2' er gyldig.
nl_nl: Geef een operand-waarde op waarmee de expressie wordt voltooid. Zorg ervoor dat het type van de operand (tekst, getal, datum of waar/onwaar) aansluit bij de expressie. Koppel getallen aan getallen, tekst aan tekst, enzovoort. De expressie 1 + 'Hallo' is bijvoorbeeld niet geldig, maar de expressie 1 + 2 is dat wel.
pl_pl: Podaj wartość operandu, która uzupełni wyrażenie. Upewnij się, że typ operandu (tekst, liczba, data lub prawda/fałsz) jest zgodny z wyrażeniem. Dopasuj liczby do liczb, tekst do tekstu itd. Na przykład wyrażenie „1 + "Cześć"” nie jest prawidłowe, ale „1 + 2” jest.
pt_br: Forneça um valor de operando que completará a expressão. Certifique-se de que o tipo do operando (texto, número, data ou verdadeiro/falso) caiba na expressão. Combine números com números, texto com texto e assim por diante. Por exemplo, '1 + "Olá"' não é válido, mas '1 + 2' é válido.
pt_pt: Forneça um valor de operando que irá concluir a expressão. Certifique-se de que o tipo de operando (texto, número, data ou verdadeiro/falso) se encaixa na expressão. Faça corresponde números com números, texto com texto, etc. Por exemplo, "1 + "Olá""não é válido, mas "1 + 2" é válido.
ro_ro: Furnizați o valoare de operand care va completa expresia. Asigurați-vă că tipul operandului (text, număr, dată sau true/false) se potrivește cu expresia. Corelați numerele cu numere, textul cu text și așa mai departe. De exemplu, expresia „1 + "Salut"” nu este validă, dar „1 + 2” este validă.
ru_ru: Укажите значение операнда, завершающее выражение. Тип операнда (текст, число, дата или True/False) должен соответствовать выражению. Сопоставляйте числа с числами, текст с текстом и т. д. Например, «1 + "Привет"» — недопустимое значение, а "1 + 2" — допустимое.
sk_sk: Zadajte hodnotu operandu, ktorý dokončí výraz. Uistite sa, že typ operandu (text, číslo, dátum alebo true/false) zodpovedá výrazu. Priraďte čísla číslam, text textu atď. Napríklad 1 + Ahoj nie je platný výraz, ale 1 + 2 je platný.
sl_si: Navedite vrednost operanda, ki bo dokončal izraz. Prepričajte se, da tip operanda (besedilo, številka, datum ali true/false) ustreza izrazu. Za številke uporabite številke, za besedilo uporabite besedilo itd. Primer: »1 + "Lep pozdrav"« ni veljaven, med tem ko »1 + 2« je veljaven.
sr_cyrl_rs: Обезбедите вредност за операнд која ће довршити израз. Уверите се да тип операнда (текст, број, датум или вредност true/false) одговара изразу. Подударите бројеве са бројевима, текст са текстом и тако даље. На пример, „1 + ’Здраво’“ није важеће, али „1 + 2“ јесте.
sr_latn_rs: Obezbedite vrednost za operand koja će dovršiti izraz. Uverite se da tip operanda (tekst, broj, datum ili vrednost true/false) odgovara izrazu. Podudarite brojeve sa brojevima, tekst sa tekstom i tako dalje. Na primer, „1 + ’Zdravo’“ nije važeće, ali „1 + 2“ jeste.
sv_se: Ange ett operandvärde som avslutar uttrycket. Se till att operandens typ (text, tal, datum eller true/false) passar uttrycket. Matcha tal med ett tal, text med text osv. ”1 + ”Hej”” är inte giltigt, men ”1 + 2” är giltigt.
th_th: ใส่ค่าตัวถูกดำเนินการที่จะทำให้นิพจน์สมบูรณ์ ตรวจสอบให้แน่ใจว่าชนิดของตัวถูกดำเนินการ (ข้อความ ตัวเลข วัน หรือจริง/เท็จ) จับคู่ตัวเลขกับตัวเลข จับคู่ข้อความกับข้อความ และอื่น ๆ ตัวอย่างเช่น '1 + "Hi"' ไม่ถูกต้อง แต่ '1 + 2' นั้นถูกต้อง
tr_tr: İfade tamamlayacak bir işlenen değeri girin. İşlenen türünün (metin, sayı, tarih veya true/false) ifadeye uyduğundan emin olun. Sayıları sayılarla, metinleri metinle vb. eşleştirin. Örneğin, '1 + "Merhaba"' geçerli değil, ancak '1 + 2' geçerlidir.
uk_ua: Додайте операнд, щоб вираз був закінченим. Переконайтеся, що тип операнда (текст, число, дата або істина/хибність) підходить для виразу. Підставляйте числа до чисел, текст до тексту тощо. Наприклад, вираз "1 + Доброго" неприпустимий, а "1 + 2" – припустимий.
vi_vn: Cung cấp một giá trị toán hạng có tác dụng hoàn thiện biểu thức. Đảm bảo rằng kiểu toán hạng (văn bản, số, ngày hoặc true/false) phù hợp với biểu thức. Khớp các số với số, văn bản với văn bản và cứ thế tiếp tục. Ví dụ: '1 + "Hi"' sẽ không hợp lệ nhưng '1 + 2' thì hợp lệ.
zh_cn: 提供用于完成表达式的操作数值。请确保操作数的类型(文本、数字、日期或 true/false)满足表达式的要求。根据要求相应使用数字、文本等类型的操作数值。例如，“1 + "嗨"”是无效的，但“1 + 2”有效。
zh_tw: 提供可以完成運算式的運算元值。運算元的類型 (文字、數字、日期或 true/false) 必須適合運算式。數字必須搭配數字，文字必須搭配文字等等。例如 '1 + "Hi"' 無效，但 '1 + 2' 有效。

# ErrorResource_ErrBadToken_ShortMessage
source: Unexpected characters. Characters are used in the formula in an unexpected way.
bg_bg: Неочаквани знаци. Знаците се използват във формулата по неочакван начин.
ca_es: Caràcters inesperats. Els caràcters s'utilitzen a la fórmula d'una manera inesperada.
cs_cz: Neočekávané znaky. Znaky se ve vzorci používají neočekávaným způsobem.
da_dk: Uventede tegn. Tegn bruges i formlen på en uventet måde.
de_de: Unerwartete Zeichen. In der Formel werden Zeichen nicht erwartungsgemäß verwendet.
el_gr: Μη αναμενόμενοι χαρακτήρες. Στον τύπο χρησιμοποιούνται χαρακτήρες με μη αναμενόμενο τρόπο.
es_es: Caracteres inesperados. Se usan caracteres en la fórmula de forma inesperada.
et_ee: Ootamatud tärgid. Tärke kasutatakse valemis ootamatul viisil.
eu_es: Ustekabeko karaktereak. Ustekabeko modu batean erabili dira karaktereak.
fi_fi: Odottamattomia merkkejä. Kaavassa käytetään merkkejä odottamattomalla tavalla.
fr_fr: Caractères inattendus. Des caractères sont utilisés dans la formule de manière inattendue.
gl_es: Caracteres inesperados. Os caracteres úsanse na fórmula dun xeito inesperado.
hi_in: अनपेक्षित वर्ण. वर्णों का उपयोग सूत्र में एक अनपेक्षित तरीके से होता है.
hr_hr: Neočekivani znakovi. Znakovi se koriste u formuli na neočekivan način.
hu_hu: Váratlan karakterek. A képletben nem várt módon használják a karaktereket.
it_it: Caratteri non previsti. I caratteri nella formula sono usati in modo imprevisto.
ja_jp: 予期しない文字があります。文字が数式内で予期しない方法で使用されています。
kk_kz: Күтпеген таңбалар. Таңбалар формулада күтпеген жолмен пайдаланылған.
ko_kr: 예기치 않은 문자가 있습니다. 문자가 식에서 예기치 않은 방식으로 사용됩니다.
lt_lt: Netikėti simboliai. Simboliai, kurie formulėje naudojami netikėtai.
lv_lv: Neparedzētas rakstzīmes. Rakstzīmes tiek lietotas formulā neparedzētā veidā.
ms_my: Aksara tidak dijangka. Aksara digunakan dalam formula dengan cara yang tidak dijangka.
nb_no: Uventede tegn. Tegnene brukes i formelen på en uventet måte.
nl_nl: Onverwachte tekens. De tekens worden in de formule op een onverwachte manier gebruikt.
pl_pl: Nieoczekiwane znaki. Znaki są używane w formule w nieoczekiwany sposób.
pt_br: Caracteres inesperados. Caracteres são usados na fórmula de forma inesperada.
pt_pt: Carateres inesperados. Os caracteres são utilizados na fórmula de forma inesperada.
ro_ro: Caractere neașteptate. Caracterele sunt utilizate în formulă într-un mod neașteptat.
ru_ru: Непредусмотренные символы. Символы не используются в формуле ожидаемым образом.
sk_sk: Neočakávané znaky. Znaky sa používajú vo vzorci neočakávaným spôsobom.
sl_si: Nepričakovani znaki. Znaki so v formuli uporabljeni na nepričakovan način.
sr_cyrl_rs: Неочекивани знакови. Знакови се користе у формули на неочекивани начин.
sr_latn_rs: Neočekivani znakovi. Znakovi se koriste u formuli na neočekivani način.
sv_se: Oväntat tecken. Tecken används på ett oväntat sätt i formeln.
th_th: อักขระที่ไม่คาดคิด มีการใช้อักขระในสูตรด้วยวิธีการที่ไม่คาดคิด
tr_tr: Beklenmeyen karakterler. Karakterler formülde beklenmeyen bir biçimde kullanılıyor.
uk_ua: Неочікувані символи. Символи використовуються у формулі неочікуваним чином.
vi_vn: Ký tự ngoài dự kiến. Ký tự được sử dụng theo cách ngoài dự kiến trong công thức này.
zh_cn: 意外字符。按意外的方式在公式中使用了字符。
zh_tw: 非預期性字元。字元在公式中的用法不符合預期。

# ErrorResource_ErrBadToken_LongMessage
source: For example, the character '\' isn't expected after a number, like this: '32\'. A space ('32') would be expected so that it's just the number 32, or another number (as in '323') would be expected.
bg_bg: Например знакът „\“ не се очаква след число, като например: „32\“. Може да се очаква интервал („32“), така че да е само числото 32, или друго число (като в „323“).
ca_es: Per exemple, el caràcter "\" no s'espera després d'un nombre, com ara: "32\". En canvi, sí que s'esperaria un espai ("32") per tal que només es mostri el número 32, o bé també s'esperaria un altre número (com ara "323").
cs_cz: Například znak \ se neočekává za číslicí, třeba takto: 32\. Očekávalo by se, že se použije mezera (32 ), což by znamenalo prostě číslo 32, nebo by se očekávala jiná číslice (třeba 323).
da_dk: For eksempel er tegnet "\" ikke forventet efter et tal, som her: "32\". Et mellemrum ("32") ville forventes, så det kun er tallet 32 eller et andet tal (som i "323"), der forventes.
de_de: Beispielsweise wird das Zeichen "\" nicht nach einer Zahl erwartet: "32\". Erwartet wird ein Leerzeichen ("32 "), das darauf hinweist, dass nur die Zahl 32 gemeint ist, oder eine andere Zahl (z. B. "323").
el_gr: Για παράδειγμα, ο χαρακτήρας "\" δεν αναμένεται μετά από έναν αριθμό, για παράδειγμα: "32\". Αναμένεται ένα κενό διάστημα ("32"), ώστε να είναι μόνο ο αριθμός 32, ή ένας άλλος αριθμός (όπως "323").
es_es: Por ejemplo, no se espera el carácter "\" después de un número, como en "32\". Se espera un espacio ("32") para que sea, simplemente, el número 32, o bien otro número (por ejemplo, "323").
et_ee: Näiteks tärki '\' ei eeldata pärast arvu, nt nii: '32\'. Tühik ('32') oleks eeldatud nii, et see oleks ainult number 32 või eeldatakse mõnda muud numbrit (nt '323').
eu_es: Adibidez, ez da espero "\" karakterea zenbaki baten ondoren erabiltzea (adibidez, "32\"). Zuriune bat gehitu behar duzu ("32 ") zehaztutako zenbakia soilik adierazteko (32), edo beste zenbaki baten parte dela adierazteko (adibidez, "323").
fi_fi: Esimerkiksi merkki \ ei ole odotettu luvun jälkeen (esimerkiksi 32 \). Väliä (32 ) odotettaan niin, että se on luku 32, tai muuten voidaan odottaa toista lukua (kuten 323).
fr_fr: Par exemple, le caractère « \ » n’est pas attendu après un nombre, comme ceci : « 32\ ». Un espace (« 32 ») est attendu afin qu’il s’agisse seulement du nombre 32, ou un autre nombre (comme dans « 323 ») est attendu.
gl_es: Por exemplo, o carácter "\" non se espera despois dun número, como no caso seguinte: "32\". Esperaríase un espazo ("32 ") para que só sexa o número 32, ou esperaríase outro número (como en "323").
hi_in: उदाहरण के लिए, किसी संख्या के बाद वर्ण '\' अपेक्षित नहीं है, जैसे कि यह: '32\'. रिक्ति ('32') की अपेक्षा की जाएगी ताकि यह केवल संख्या 32 हो, या किसी अन्य संख्या (जैसा कि '323' में है) की अपेक्षा की जाएगी.
hr_hr: Znak "\", na primjer, nije očekivan nakon broja, kao što je: "32\". Očekuje se razmak ("32") pa je to broj 32 ili se očekuje neki drugi broj (na primjer, "323").
hu_hu: A „\” karakter például váratlan egy szám után, például a következőképpen: „32\”. A szóköz („32 ”) várható, ha csak a 32 számot eredményezi, illetve várható egy másik szám (példa: „323”).
it_it: Ad esempio, il carattere '\' non è previsto dopo un numero, come in: '32\'. È previsto uno spazio ('32'), a indicare semplicemente il numero 32, oppure un altro numero (come '323').
ja_jp: たとえば、文字 '\' は、次のように数字の後に置かれることはありません: '32\'。スペースが入る可能性があり ('32 ')、その場合は単に 32 という数値です。または別の数字が入る可能性もあります ('323')。
kk_kz: Мысалы, "\" таңбасы саннан кейін күтілмеген: "32\". Бос орын ("32") ол тек 32 саны болатындай күтілуі мүмкін немесе басқа сан ("323" санындағы сияқты) күтілуі мүмкін.
ko_kr: 예를 들어, 숫자 뒤에 문자 '\'는 필요하지 않습니다(예: '32\'). 숫자 32 또는 다른 숫자(예: '323')가 오도록 공백('32')이 필요합니다.
lt_lt: Pavyzdžiui, po skaičiaus nenumatomas simbolis \, kaip antai: 32\. Galima numatyti tarpą (32), jei tai yra tiesiog skaičius 32, arba galima numatyti kitą skaičių (pvz., 323).
lv_lv: Piemēram, rakstzīmi “\” nav paredzēts izmantot aiz skaitļa: “32\”. Pēc skaitļa paredzēts izmantot atstarpi (“32 ” – tiek norādīts tikai skaitlis 32) vai arī vēl vienu skaitli (piemēram, “323”).
ms_my: Contohnya, aksara '\' tidak dijangka selepas nombor, seperti ini: '32\'. Ruang ('32') akan dijangka supaya ia hanya nombor 32, atau nombor lain (seperti dalam '323') akan dijangka.
nb_no: For eksempel kan ikke tegnet «\» komme etter et tall, slik som dette: «32\». Det forventes et mellomrom (32), slik at det bare er tallet 32, eller et annet tall (f.eks. 323) forventes.
nl_nl: Het teken \ wordt bijvoorbeeld niet verwacht na een getal zoals bij 32\. Er wordt een spatie (32 ) verwacht als het alleen het getal 32 betreft, anders wordt er een ander getal (zoals 323) verwacht.
pl_pl: Na przykład znak „\” nie jest oczekiwany po cyfrze, tzn. „32\”. Oczekiwana jest spacja („32 ”), co będzie oznaczać po prostu liczbę 32, lub inna cyfra (np. „323”).
pt_br: Por exemplo, o caractere '\' não é esperado depois de um número, como em: '32\'. Um espaço ('32') seria esperado para indicar apenas o número 32, ou outro número (como em '323') seria esperado.
pt_pt: Por exemplo, o caráter "\" não é esperado após um número, desta forma: "32\". Um espaço ("32") seria esperado para que fosse apenas o número 32 ou seria esperado outro número (por exemplo "323").
ro_ro: De exemplu, caracterul „\” nu este așteptat după un număr, în felul următor: „32\”. S-ar aștepta un spațiu („32 ”), astfel încât să fie doar numărul 32 sau un alt număr (precum în „323”).
ru_ru: Например, символ "\" не может идти после числа: "32\". Будет ожидаться либо пробел ("32"), если имеется в виду просто число 32, либо другое число ("323").
sk_sk: Napríklad znak \ sa neočakáva za číslom, ako napríklad: 32\. Ak by išlo iba o číslo 32, očakávala by sa medzera (32 ), resp. by sa očakávalo iné číslo (napríklad 323).
sl_si: Znaka »\« ne smete uporabiti za številko, na primer tako: »32\«. Pričakovan je presledek (»32«), tako da je samo številka 32 ali druga številka (na primer »323«).
sr_cyrl_rs: На пример, знак „\“ се не очекује после броја, овако: „32\“. Очекује се размак („32 “) како би то био само број 32 или се очекује неки други број (на пример, „323“).
sr_latn_rs: Na primer, znak „\“ se ne očekuje posle broja, ovako: „32\“. Očekuje se razmak („32 “) kako bi to bio samo broj 32 ili se očekuje neki drugi broj (na primer, „323“).
sv_se: Tecknet '\' förväntas t.ex. inte efter ett tal, som exempelvis i: 32\'. Ett blanksteg (32 ) borde förväntas, så att det bara är talet 32, eller ett annat tal (som i 323) som förväntas.
th_th: ตัวอย่างเช่น อักขระ '\' ไม่ใช่อักขระที่ต้องการให้อยู่หลังตัวเลขอย่าง '32\' พื้นที่ว่าง ('32 ') คืออักขระที่ต้องการเพื่อให้มีเพียงตัวเลข 32 หรือตัวเลขอื่น (เช่น '323') จึงจะถูกต้อง
tr_tr: Örneğin, '\' karakteri bir sayıdan sonra beklenmez (örneğin, '32\'). Yalnızca 32 sayısı olması için bir boşluk ('32 ') veya başka bir sayı ('323' gibi) bekleniyor.
uk_ua: Наприклад, після числа не має бути символу "\", як тут: "32\". Там очікується пробіл (наприклад, "32 ", якщо це просто число 32) або цифра (наприклад, "323").
vi_vn: Ví dụ: không dự kiến có ký tự '\' sau một số, như thế này: '32\'. Dự kiến có dấu cách ('32') để số đó chỉ là số 32 hoặc có thể dự kiến một số khác (như trong '323').
zh_cn: 例如，数字不得后跟字符 "\" (如 "32\")，而应接空格("32")，这样可确保其仅为数字 32 或为其他数字(例如 "323")。
zh_tw: 例如數字之後不應有字元 '\'，像是 '32\'。數字之後應空白 ('32')，才會視為數字 32，否則將視為其他數字，如 '323'。
